app/controllers/user_controller.rb

	def index
		@users = Users.all
---
SELECT "users".* FROM "users"

	def create
		@user = Users.new(user_params)
 		@user.save
---
INSERT INTO "users" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-18 09:36:46.526159"], ["name", "shalini"], ["updated_at", "2014-09-18 09:36:46.526159"]]

	def destroy
		@user = Users.find(params[:id])
		@user.delete
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = 1